Documents/СписаниеВспомогательныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СписаниеВспомогательныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПоБухгалтерии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоБухгалтерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСписания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииМИДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныСписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НормыРасходВспомогательныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НормыРасходВспомогательныхСредств</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииМИДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СписаниеВспомогательныхСредств/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура СлужебнаяЗаписка(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.СписаниеВспомогательныхСредств.ПолучитьМакет("СлужебнаяЗаписка");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаниеВспомогательныхСредств.Автор,
		|	СписаниеВспомогательныхСредств.Дата,
		|	СписаниеВспомогательныхСредств.Номер,
		|	СписаниеВспомогательныхСредств.Номенклатура.(
		|		НомерСтроки,
		|		Материал,
		|		КодПоБухгалтерии,
		|		КоличествоСписания,
		|		ПричинаСписания
		|	)
		|ИЗ
		|	Документ.СписаниеВспомогательныхСредств КАК СписаниеВспомогательныхСредств
		|ГДЕ
		|	СписаниеВспомогательныхСредств.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
		ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.НаименованиеОрганизации = ОбщегоНазначенияСервер.ПолучитьНаименованиеОрганизации();
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьНоменклатураШапка);
			ВыборкаНоменклатура = Выборка.Номенклатура.Выбрать();
			Нумератор = 1;
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Если ВыборкаНоменклатура.КоличествоСписания <> 0 Тогда
					ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
					ОбластьНоменклатура.Параметры.НомерСтрокиН =Нумератор;
					Нумератор = Нумератор + 1;
					ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
				КонецЕсли;
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура Контроль(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.СписаниеВспомогательныхСредств.ПолучитьМакет("Контроль");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(СписаниеВспомогательныхСредствНоменклатура.КоличествоСписания) КАК КоличествоСписания,
		|	СписаниеВспомогательныхСредствНоменклатура.Категория КАК Категория
		|ПОМЕСТИТЬ РасходМатериалов
		|ИЗ
		|	Документ.СписаниеВспомогательныхСредств.Номенклатура КАК СписаниеВспомогательныхСредствНоменклатура
		|ГДЕ
		|	СписаниеВспомогательныхСредствНоменклатура.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеВспомогательныхСредствНоменклатура.Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыРасходВспомогательныхСредствСрезПоследних.Склад КАК Склад,
		|	НормыРасходВспомогательныхСредствСрезПоследних.КатегорияМатериалов КАК КатегорияМатериалов,
		|	НормыРасходВспомогательныхСредствСрезПоследних.Количество КАК Количество,
		|	РасходМатериалов.КоличествоСписания КАК КоличествоСписания
		|ИЗ
		|	РасходМатериалов КАК РасходМатериалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормыРасходВспомогательныхСредств.СрезПоследних(&ДатаДокумента, ) КАК НормыРасходВспомогательныхСредствСрезПоследних
		|		ПО РасходМатериалов.Категория = НормыРасходВспомогательныхСредствСрезПоследних.КатегорияМатериалов
		|ГДЕ
		|	НормыРасходВспомогательныхСредствСрезПоследних.Склад = &Склад";
		Запрос.Параметры.Вставить("Ссылка", Ссылка[0]);
		Запрос.Параметры.Вставить("ДатаДокумента", Ссылка[0].Дата);
		Запрос.Параметры.Вставить("Склад", Ссылка[0].Автор.СкладСырья);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
		ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьНоменклатураШапка);
		
		Пока Выборка.Следующий() Цикл
			ОбластьНоменклатура.Параметры.Заполнить(Выборка);
			ОбластьНоменклатура.Параметры.Контроль = ?(Выборка.КоличествоСписания > Выборка.Количество, "Перерасход", "ОК");
			ТабДок.Вывести(ОбластьНоменклатура);
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти
